kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-OLED-V_4_7_4/ESP32-S3-Host-OLED-V_4_7_4.ino
float hostBatteryVolts = 4.2;
int hostBatteryPct = 100;

bool globalAlarmTriggered            = false;
unsigned long lastBuzzerAlarmTime    = 0;
uint8_t nearChimeRemaining           = 0;
unsigned long nearChimeNextBeep      = 0;

void updateHostOLED();

// ----------------------------------------------------------------------------
// ฟังก์ชันช่วย
// ----------------------------------------------------------------------------
uint8_t safeDropFactor(uint8_t df) {
  return (df == 10 || df == 15 || df == 20 || df == 60) ? df : 20;
}

bool isCriticalAlert(uint8_t code) {
  return code == ALERT_TOO_FAST || code == ALERT_TOO_SLOW ||
         code == ALERT_COMPLETE || code == ALERT_OCCLUSION ||
         code == ALERT_NO_SIGNAL;
}

// รหัสที่ส่งออกไปให้ Station — Station รุ่นเก่าไม่รู้จัก ALERT_NO_SIGNAL
// จึงต้องแปลงเป็น ALERT_NONE เสมอ เพื่อให้เข้ากันได้กับทุกรุ่นตั้งแต่ 7.4.x ขึ้นไป
uint8_t alertCodeForStation(uint8_t code) {
  return (code == ALERT_NO_SIGNAL) ? ALERT_NONE : code;
}

uint8_t safeNearPct(uint8_t p) {
  return (p >= 50 && p <= 95) ? p : DEFAULT_NEAR_END_PCT;
}

bool isSnoozed() {
  return globalSnoozeUntil > 0 && millis() < globalSnoozeUntil;
}

bool isStationOnline(int i) {
  unsigned long lr = stations[i].lastRecvTime;
  if (lr == 0) return false;
  unsigned long now = millis();
  return (now < lr) || (now - lr < ONLINE_TIMEOUT_MS);
}

// เกณฑ์เวลา "ไม่มีหยด" = 2.5 เท่าของช่วงหยดตามเป้าหมาย (ขั้นต่ำ 8 วินาที) — สูตรเดียวกับ Station
uint32_t occlusionThresholdMs(float rateHr, uint8_t df) {
  if (rateHr <= 0.0f) return MIN_OCCLUSION_MS;
  float dropsPerHr = rateHr * (float)df;
  uint32_t expected = (uint32_t)(3600000.0f / dropsPerHr);
  uint32_t th = (expected * 5) / 2;
  if (th < MIN_OCCLUSION_MS) th = MIN_OCCLUSION_MS;
  if (th > MAX_OCCLUSION_MS) th = MAX_OCCLUSION_MS;
  return th;
}

// เตียงที่ออนไลน์และกำลังนับ แต่ไม่เคยมีหยดเลยตั้งแต่ติดต่อกันได้
// แยกจากสายพับ เพราะสายพับคือ "เคยไหลแล้วหยุด" ส่วนอันนี้คือ "ไม่เคยเริ่มเลย"
bool isStationNoSignal(int i) {
  const StationData &s = stations[i];
  if (!isStationOnline(i) || !s.isRunning) return false;
  if (s.totalDrops > 0) return false;                 // เคยจับหยดได้แล้ว = ไม่ใช่กรณีนี้
  if (s.firstRecvTime == 0) return false;
  return (millis() - s.firstRecvTime) > NO_SIGNAL_MS;
}

// เตียงนี้มีมากกว่าหนึ่งบอร์ดส่งมาด้วยเลขเดียวกันหรือไม่
bool hasIdConflict(int i) {
  return stations[i].idConflict;
}

bool anyIdConflict() {
  for (int i = 0; i < activeStationCount; i++) if (stations[i].idConflict) return true;
  return false;
}

// เคยได้ยินเลขเตียงนี้ภายใน 1 นาทีที่ผ่านมาไหม (ใช้ได้แม้เลขเกินจำนวนเตียงที่เปิดใช้)
bool heardStationId(int i) {
  unsigned long t = heardIdAt[i];
  return t != 0 && (millis() - t) < HEARD_REMEMBER_MS;
}

// มีบอร์ดส่งเลขเตียงเกินจำนวนที่เปิดใช้อยู่หรือไม่ — คืนเลขเตียงตัวแรกที่เจอ (0 = ไม่มี)
uint8_t heardBeyondBedCount() {
  for (int i = activeStationCount; i < MAX_SUPPORTED_STATIONS; i++) {
    if (heardStationId(i)) return (uint8_t)(i + 1);
  }
  return 0;
}

// MAC ท้าย 3 ไบต์ พอให้แยกบอร์ดออกจากกันได้โดยไม่กินพื้นที่จอ
String macTail(const StationData &s) {
  if (!s.macKnown) return String("-");
  char b[12];
  snprintf(b, sizeof(b), "%02X:%02X:%02X", s.srcMac[3], s.srcMac[4], s.srcMac[5]);
  return String(b);
}

bool isStationOccluded(int i) {
  const StationData &s = stations[i];
  if (!isStationOnline(i) || !s.isRunning || s.totalDrops == 0 || s.msSinceLastDrop == 0) return false;
  unsigned long age = millis() - s.lastRecvTime;
  uint32_t since = s.msSinceLastDrop + (uint32_t)age;
  return since > occlusionThresholdMs(s.cfg.targetRateHr, safeDropFactor(s.cfg.dropFactor));
}

const char* alertTextEn(uint8_t code) {
  switch (code) {
    case ALERT_TOO_FAST:  return "TOO FAST";
    case ALERT_TOO_SLOW:  return "TOO SLOW";
    case ALERT_NEAR_END:  return "NEXT BAG";
    case ALERT_COMPLETE:  return "BAG EMPTY";
    case ALERT_OCCLUSION: return "OCCLUSION";
    case ALERT_NO_SIGNAL: return "NO SIGNAL";
    default:              return "NORMAL";
  }
}

String jsonEscape(const char* s) {
  String o;
  for (const char* p = s; *p; p++) {
    char c = *p;
    if (c == '"' || c == '\\') { o += '\\'; o += c; }
    else if ((uint8_t)c < 0x20) o += ' ';
    else o += c;
  }
  return o;
}

uint8_t currentWifiChannel() {
  uint8_t primary = 0;
  wifi_second_chan_t second;
  esp_wifi_get_channel(&primary, &second);
  return primary;
}

// ----------------------------------------------------------------------------
// ค่าตั้งเตียง (เก็บถาวรใน NVS)
// ----------------------------------------------------------------------------
void loadBedConfigs() {
  preferences.begin("bed-cfg", true);
  for (int i = 0; i < MAX_SUPPORTED_STATIONS; i++) {
    char key[6];
    snprintf(key, sizeof(key), "b%d", i + 1);
    if (preferences.getBytesLength(key) == sizeof(BedConfig)) {
      preferences.getBytes(key, &stations[i].cfg, sizeof(BedConfig));
      stations[i].cfg.dropFactor = safeDropFactor(stations[i].cfg.dropFactor);
      stations[i].cfg.patientName[sizeof(stations[i].cfg.patientName) - 1] = '\0';
    }
    char pkey[6];
    snprintf(pkey, sizeof(pkey), "p%d", i + 1);
    stations[i].nearEndPct = safeNearPct(preferences.getUChar(pkey, DEFAULT_NEAR_END_PCT));
    stations[i].trialCase.active     = stations[i].cfg.planVolumeMl > 0;
    stations[i].trialCase.planVolume = stations[i].cfg.planVolumeMl;
    stations[i].trialCase.targetRate = stations[i].cfg.targetRateHr;
  }
  preferences.end();
}

void saveBedConfig(int idx) {
  char key[6];
  snprintf(key, sizeof(key), "b%d", idx + 1);
  preferences.begin("bed-cfg", false);
  preferences.putBytes(key, &stations[idx].cfg, sizeof(BedConfig));
  char pkey[6];
  snprintf(pkey, sizeof(pkey), "p%d", idx + 1);
  preferences.putUChar(pkey, stations[idx].nearEndPct);
  preferences.end();
}

// ----------------------------------------------------------------------------
// ระบบเวลาและการซิงก์ข้อมูล
// ----------------------------------------------------------------------------
String getFormattedDateTime() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 10)) {
    char buf[24];
    snprintf(buf, sizeof(buf), "Min-%04u", (unsigned)globalMinuteCounter);
    return String(buf);
  }
  char buf[24];
  strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", &timeinfo);
  return String(buf);
}

String getOledClockStr() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 10)) return "--:--";
  char buf[12];
  strftime(buf, sizeof(buf), "%H:%M", &timeinfo);
  return String(buf);
}

// นาฬิกาพร้อมใช้งานหรือยัง (ตั้งจากเครื่องผู้ใช้ หรือกู้จากค่าที่สำรองไว้)
bool hasValidClock() {
  time_t now;
  time(&now);
  return now > 1600000000;
}

// บันทึกเวลาปัจจุบันลง NVS เพื่อกู้คืนเมื่อไฟดับ (ไม่มี RTC สำรองในบอร์ด)
void backupClockToNvs() {
  time_t now;
  time(&now);
  if (now <= 1600000000) return;
  preferences.begin("sys-config", false);
  preferences.putUInt("lastEpoch", (uint32_t)now);
  preferences.end();
}

// ----------------------------------------------------------------------------
// การส่ง Sync ให้ Station — แบบเฉลี่ยช่องเวลา ไม่มี delay() (ใหม่ใน v4.7.3)
// ----------------------------------------------------------------------------
// ของเดิมส่งรวดเดียว N ใบติดกัน คั่นด้วย delay(4) อยู่ใน loop() ทุก 1 วินาที
// ผลคือ (1) loop() ถูกบล็อก 32-50 ms ทุกวินาที และ (2) คลื่นวิทยุถูกใช้เป็นช่วงกระชาก
// ทับจังหวะที่ Station กำลังส่งข้อมูลกลับมาพอดี ยิ่งมีหลายเตียงยิ่งชนบ่อย
// ของใหม่ส่งทีละใบ ห่างกันเท่า ๆ กันตลอดวินาที แต่ละเตียงยังได้รับครบ 1 ใบต่อวินาทีเหมือนเดิม
uint16_t syncSlotIntervalMs() {
  uint8_t n = (activeStationCount < 1) ? 1 : activeStationCount;
  uint16_t slot = SYNC_INTERVAL_MS / n;
  if (slot < SYNC_SLOT_MIN_MS) slot = SYNC_SLOT_MIN_MS;
  return slot;
}

void sendSyncForStation(int i) {
  if (i < 0 || i >= MAX_SUPPORTED_STATIONS) return;

  time_t now;
  time(&now);

  struct_host_sync syncMsg = {};
  syncMsg.epochTime    = (now > 1600000000) ? (uint32_t)now : 0;
  syncMsg.isSynced     = (now > 1600000000) ? 1 : 0;
  syncMsg.stationId    = i + 1;
  syncMsg.targetRateHr = stations[i].cfg.targetRateHr;
  syncMsg.totalPlanMl  = stations[i].cfg.planVolumeMl;
  syncMsg.alertCode    = alertCodeForStation(stations[i].alertCode);  // กันรหัสที่ Station รุ่นเก่าไม่รู้จัก
  syncMsg.dropFactor   = safeDropFactor(stations[i].cfg.dropFactor);
  syncMsg.resetSeq     = stations[i].cfg.resetSeq;
  syncMsg.hostChannel  = currentWifiChannel();
  syncMsg.nearEndPct   = safeNearPct(stations[i].nearEndPct);
  syncMsg.flags        = stations[i].nearEndAck ? 0x01 : 0x00;

