kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-OLED-V_4_7_4/ESP32-S3-Host-OLED-V_4_7_4.ino
  // ---- ล็อกเฟสแอนิเมชันหยด ----
  // Station บอกมาว่า "หยดล่าสุดผ่านมาแล้วกี่มิลลิวินาที" จึงย้อนกลับไปหาเวลาที่หยดนั้นตก
  // ในฐานเวลาของ Host ได้ แอนิเมชันบนจอ Host จึงเดินตรงจังหวะกับหยดจริงที่เตียงนั้น
  if (incoming.msSinceLastDrop > 0 && incoming.msSinceLastDrop < 600000UL) {
    s.lastDropAtMs = s.lastRecvTime - incoming.msSinceLastDrop;
  }

  if (s.firstRecvTime == 0) s.firstRecvTime = s.lastRecvTime;
  // ตราบใดที่ยังมีหยดเข้ามา ให้เลื่อนเวลาอ้างอิงตาม เมื่อกด "เริ่มถุงใหม่" แล้วตัวนับกลับเป็น 0
  // ตัวจับเวลา 90 วินาทีจึงเริ่มนับจากจังหวะรีเซ็ต ไม่ใช่จากตอนเปิดเครื่อง
  if (s.totalDrops > 0) s.firstRecvTime = s.lastRecvTime;
  if ((incoming.flags & 0x01) && s.cfg.planVolumeMl > 0) s.nearEndAck = true;

  if (s.trialCase.active) {
    s.trialCase.actualVolume = s.totalVolumeMl;
    s.trialCase.errorMl = s.trialCase.actualVolume - s.trialCase.planVolume;
    if (s.trialCase.planVolume > 0) {
      s.trialCase.errorPercent = (s.trialCase.errorMl / s.trialCase.planVolume) * 100.0;
    }
  }
  portEXIT_CRITICAL(&dataMux);
}

// ----------------------------------------------------------------------------
// Host OLED Display & Block-Style UI Renderer
// ----------------------------------------------------------------------------
// ----------------------------------------------------------------------------
// แอนิเมชันหยดน้ำเกลือบนจอ OLED (ใหม่ใน v4.7.3)
// ----------------------------------------------------------------------------
// หลักคิด: ไม่ได้ "เดา" จังหวะหยดเอง แต่ล็อกเฟสกับหยดจริงที่ Station วัดได้
//   - Station ส่ง msSinceLastDrop มาทุกวินาที -> ย้อนกลับไปได้ว่าหยดล่าสุดตกเมื่อใด
//   - คาบการหยดคำนวณจากอัตราไหลจริง: 3600000 / (mL/h x หยดต่อ mL)
// ผลคือหยดที่เห็นบนจอ Host ตรงจังหวะกับหยดที่ตกจริงในกระเปาะของเตียงนั้น
// และเมื่อ Station หยุด/สายพับ ภาพจะเปลี่ยนเป็นสัญลักษณ์ชุดเดียวกับที่จอ Station ใช้

DripMode dripModeOf(int i) {
  if (!isStationOnline(i)) return DRIP_OFFLINE;
  const StationData &s = stations[i];
  if (!s.isRunning) return DRIP_PAUSED;
  if (s.alertCode == ALERT_OCCLUSION || s.alertCode == ALERT_NO_SIGNAL) return DRIP_ALERT;
  return DRIP_FLOW;
}

// คาบการหยดที่วัดได้จริง (มิลลิวินาทีต่อหนึ่งหยด) — 0 = ยังคำนวณไม่ได้
uint32_t dripPeriodMs(int i) {
  const StationData &s = stations[i];
  float dropsPerHr = s.flowRate_ml_hr * (float)safeDropFactor(s.cfg.dropFactor);
  if (dropsPerHr < 1.0f) return 0;
  uint32_t p = (uint32_t)(3600000.0f / dropsPerHr);
  if (p < 150) p = 150;        // เร็วกว่านี้ตามนุษย์ก็แยกไม่ออกอยู่ดี
  if (p > 20000) p = 20000;
  return p;
}

// เฟสของแอนิเมชัน:  0..100 = กำลังตก (% ของระยะทาง)
//                   -1     = ยังไม่ถึงหยดถัดไป
//                   -2     = เพิ่งตกถึงผิวน้ำ (วาดคลื่นกระเพื่อม)
int dripAnimPhase(int i) {
  if (dripModeOf(i) != DRIP_FLOW) return -1;
  const StationData &s = stations[i];
  uint32_t period = dripPeriodMs(i);
  if (period == 0 || s.lastDropAtMs == 0) return -1;

  uint32_t fall = DROP_FALL_MS;
  if (fall > period * 3 / 4) fall = period * 3 / 4;   // หยดถี่ = ตกเร็วขึ้น ไม่ให้ซ้อนกัน
  if (fall < 40) fall = 40;

  uint32_t phase = (uint32_t)(millis() - s.lastDropAtMs) % period;
  if (phase < fall) return (int)((phase * 100UL) / fall);
  if (phase < fall + 120) return -2;
  return -1;
}

// มีเตียงไหนกำลังหยดอยู่บ้างไหม — ใช้ตัดสินว่าต้องรีเฟรชจอถี่หรือไม่
// v4.7.4: กระเปาะหยดเหลืออยู่เฉพาะหน้ารายละเอียดของแต่ละเตียง
// หน้ารวมจึงไม่ต้องรีเฟรชถี่อีกต่อไป ประหยัดทั้งบัส I2C และเวลาในลูป
bool anyBedDripping() {
  int idx = currentOledPage - 1;
  if (idx < 0 || idx >= activeStationCount) return false;
  return dripModeOf(idx) == DRIP_FLOW && dripPeriodMs(idx) > 0;
}

// กระเปาะขนาดจิ๋ว กว้าง 6 px สำหรับการ์ดเตียงในหน้ารวม (h ตั้งแต่ 6 px ขึ้นไป)
void drawDripMini(int x, int y, int h, int i) {
  if (h < 6) h = 6;
  u8g2.drawFrame(x, y, 6, h);               // ตัวกระเปาะ
  u8g2.drawBox(x + 2, y + 1, 2, 1);         // หัวหยด

  switch (dripModeOf(i)) {
    case DRIP_OFFLINE:
      u8g2.drawLine(x + 1, y + 2, x + 4, y + h - 3);
      u8g2.drawLine(x + 4, y + 2, x + 1, y + h - 3);
      return;
    case DRIP_PAUSED:
      u8g2.drawVLine(x + 1, y + 2, h - 4);
      u8g2.drawVLine(x + 4, y + 2, h - 4);
      return;
    case DRIP_ALERT:
      u8g2.drawVLine(x + 2, y + 2, h - 5);
      u8g2.drawBox(x + 2, y + h - 2, 2, 1);
      return;
    default:
      break;
  }

  int poolY = y + h - 3;
  u8g2.drawBox(x + 1, poolY, 4, 2);         // ผิวน้ำในกระเปาะ

  int pct = dripAnimPhase(i);
  if (pct == -2) {                          // กระเพื่อมตอนหยดถึงผิวน้ำ
    u8g2.drawHLine(x + 1, poolY - 1, 4);
  } else if (pct >= 0) {
    int top = y + 2;
    int bot = poolY - 2;
    if (bot < top) bot = top;
    int dy  = top + ((bot - top) * pct) / 100;
    u8g2.drawBox(x + 2, dy, 2, 2);          // หยดที่กำลังตก
  }
}

// กระเปาะเต็มรูปแบบ กว้าง 15 px — ใช้ในหน้า 1-2 เตียง และหน้ารายละเอียด
void drawDripChamber(int x, int y, int h, int i) {
  u8g2.drawRFrame(x, y, 15, h, 3);
  u8g2.drawBox(x + 6, y + 2, 3, 3);         // หัวหยด

  DripMode m = dripModeOf(i);
  int poolTop = y + h - 9;

  if (m == DRIP_OFFLINE) {
    u8g2.drawLine(x + 4, y + 10, x + 10, y + h - 6);
    u8g2.drawLine(x + 10, y + 10, x + 4, y + h - 6);
    return;
  }
  if (m == DRIP_PAUSED) {
    u8g2.drawBox(x + 4, y + 11, 2, h - 20);
    u8g2.drawBox(x + 9, y + 11, 2, h - 20);
    return;
  }
  if (m == DRIP_ALERT) {
    u8g2.drawBox(x + 7, y + 10, 2, h - 22);
    u8g2.drawBox(x + 7, y + h - 10, 2, 2);
    return;
  }

  u8g2.drawBox(x + 2, poolTop, 11, 7);      // น้ำที่ก้นกระเปาะ
  int pct = dripAnimPhase(i);
  if (pct == -2) {
    u8g2.setDrawColor(0);                   // คลื่นกระเพื่อมบนผิวน้ำ
    u8g2.drawHLine(x + 3, poolTop + 1, 9);
    u8g2.setDrawColor(1);
    u8g2.drawHLine(x + 2, poolTop - 1, 11);
  } else if (pct >= 0) {
    int top = y + 7;
    int bot = poolTop - 3;
    int dy  = top + ((bot - top) * pct) / 100;
    u8g2.drawBox(x + 6, dy, 3, 3);
  }
}

// คำสถานะสั้น ๆ ที่พยาบาลอ่านจบในแวบเดียว (อังกฤษ เพราะฟอนต์ในจอไม่มีตัวไทย)
const char* shortStatusOf(int i) {
  const StationData &s = stations[i];
  if (!isStationOnline(i))      return "OFFLINE";
  if (s.idConflict)             return "ID DUP";
  if (!s.isRunning)             return "PAUSE";
  switch (s.alertCode) {
    case ALERT_TOO_FAST:  return "FAST";
    case ALERT_TOO_SLOW:  return "SLOW";
    case ALERT_OCCLUSION: return "STOP";
    case ALERT_NO_SIGNAL: return "NO DRIP";
    case ALERT_COMPLETE:  return "DONE";
    case ALERT_NEAR_END:  return s.nearEndAck ? "NEAR" : "NEW BAG";
    default:              return "OK";
  }
}

// เวอร์ชันสั้นไม่เกิน 4 ตัวอักษร สำหรับการ์ดในหน้ารวมที่มีที่จำกัด
// ต้องไม่เกิน 4 ตัว ไม่เช่นนั้นจะไปทับตัวเลขอัตราไหล
const char* gridStatusOf(int i) {
  const StationData &s = stations[i];
  if (!isStationOnline(i))      return "OFF";
  if (s.idConflict)             return "DUP!";
  if (!s.isRunning)             return "PAUS";
  switch (s.alertCode) {
    case ALERT_TOO_FAST:  return "FAST";
    case ALERT_TOO_SLOW:  return "SLOW";
    case ALERT_OCCLUSION: return "STOP";
    case ALERT_NO_SIGNAL: return "SENS";
    case ALERT_COMPLETE:  return "DONE";
    case ALERT_NEAR_END:  return s.nearEndAck ? "near" : "BAG!";
    default:              return "OK";
  }
}

