kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-OLED-V_4_7_4/ESP32-S3-Host-OLED-V_4_7_4.ino
// เตียงนี้ต้องให้คนไปดูหรือไม่ (ใช้ตัดสินว่าจะทำการ์ดเป็นแถบทึบ)
bool bedNeedsAttention(int i) {
  const StationData &s = stations[i];
  if (!isStationOnline(i)) return true;
  if (s.idConflict) return true;
  return s.isRunning && isCriticalAlert(s.alertCode);
}

// ----------------------------------------------------------------------------
// หน้ารวมทุกเตียง — เน้นอ่านจากระยะไกล
// ----------------------------------------------------------------------------
// v4.7.4 ตัดสิ่งที่มองไม่เห็นจริงบนจอ 128x64 ออก: ไม่มีกระเปาะหยด ไม่มีปริมาตรสะสม
// เหลือสามอย่างที่ตัดสินใจได้ทันที — เลขเตียง / อัตราไหล / คำสถานะ
// แล้วใช้พื้นที่ที่เหลือขยายฟอนต์จาก 4x6 เป็น 6x10 (3-6 เตียง) และ 5x8 (7-8 เตียง)
// กระเปาะหยดย้ายไปอยู่หน้ารายละเอียดของแต่ละเตียงแทน ซึ่งมีที่ให้วาดใหญ่พอจะเห็นจริง
void renderBlockStyleGrid() {
  int topY = 11;
  int bottomY = 53;
  int totalH = bottomY - topY;

  int onlineCount = 0;
  int alarmBed = 0;
  uint8_t alarmCode = ALERT_NONE;

  for (int i = 0; i < activeStationCount; i++) {
    if (isStationOnline(i)) onlineCount++;
    if (alarmBed == 0 && isCriticalAlert(stations[i].alertCode)) {
      alarmBed = i + 1;
      alarmCode = stations[i].alertCode;
    }
  }

  if (activeStationCount == 1) {
    u8g2.drawRFrame(0, topY + 1, 128, totalH - 1, 3);
    bool online = isStationOnline(0);

    if (!online || !stations[0].isRunning) {
      u8g2.setFont(u8g2_font_logisoso16_tf);
      u8g2.drawStr(14, topY + 30, online ? "PAUSED" : "OFFLINE");
    } else {
      char rBuf[16];
      snprintf(rBuf, sizeof(rBuf), "%.0f", stations[0].flowRate_ml_hr);
      u8g2.setFont(u8g2_font_logisoso32_tf);
      u8g2.drawStr(8, topY + 36, rBuf);
      u8g2.setFont(u8g2_font_6x10_tf);
      u8g2.drawStr(78, topY + 22, "mL/h");
      u8g2.setFont(u8g2_font_7x13_tf);
      u8g2.drawStr(78, topY + 36, shortStatusOf(0));
    }
  }
  else if (activeStationCount == 2) {
    int cardW = 62;
    for (int i = 0; i < 2; i++) {
      int x = (i == 0) ? 0 : 66;
      u8g2.drawRFrame(x, topY + 1, cardW, totalH - 1, 2);

      char idStr[10];
      snprintf(idStr, sizeof(idStr), "BED %d", i + 1);
      u8g2.setFont(u8g2_font_5x8_tf);
      u8g2.drawStr(x + 4, topY + 11, idStr);

      if (!isStationOnline(i) || !stations[i].isRunning) {
        u8g2.setFont(u8g2_font_7x13_tf);
        u8g2.drawStr(x + 4, topY + 27, isStationOnline(i) ? "PAUSE" : "OFF");
      } else {
        char rBuf[16];
        snprintf(rBuf, sizeof(rBuf), "%.0f", stations[i].flowRate_ml_hr);
        u8g2.setFont(u8g2_font_logisoso16_tf);
        u8g2.drawStr(x + 4, topY + 29, rBuf);
        u8g2.setFont(u8g2_font_5x8_tf);
        u8g2.drawStr(x + 40, topY + 29, "mL/h");
      }

      u8g2.setFont(u8g2_font_6x10_tf);
      u8g2.drawStr(x + 4, topY + 39, shortStatusOf(i));
    }
  }
  else {
    int cardW = 62;
    int rows = (activeStationCount + 1) / 2;
    int rowH = (rows <= 3) ? 14 : 10;   // 3-6 เตียง = 3 แถว, 7-8 เตียง = 4 แถว
    bool bigFont = (rowH == 14);

    for (int i = 0; i < activeStationCount; i++) {
      int col = i % 2;
      int row = i / 2;
      int x = (col == 0) ? 0 : 65;
      int y = topY + row * rowH;
      int textY = y + (bigFont ? 10 : 7);

      bool attn = bedNeedsAttention(i);

      // เตียงที่ต้องไปดู = การ์ดทึบทั้งใบ มองเห็นได้จากท้ายห้อง
      if (attn) { u8g2.drawRBox(x, y, cardW, rowH - 1, 2); u8g2.setDrawColor(0); }
      else      { u8g2.drawRFrame(x, y, cardW, rowH - 1, 2); }

      u8g2.setFont(bigFont ? u8g2_font_6x10_tf : u8g2_font_5x8_tf);

      char idStr[6];
      snprintf(idStr, sizeof(idStr), "%d", i + 1);
      u8g2.drawStr(x + 3, textY, idStr);

      if (isStationOnline(i) && stations[i].isRunning) {
        char rBuf[8];
        snprintf(rBuf, sizeof(rBuf), "%3.0f", stations[i].flowRate_ml_hr);
        u8g2.drawStr(x + (bigFont ? 11 : 10), textY, rBuf);
      }

      // คำสถานะชิดขวาของการ์ดเสมอ ตาจึงกวาดหาคำผิดปกติได้เป็นแนวตั้ง
      const char *st = gridStatusOf(i);
      int adv = bigFont ? 6 : 5;
      int stX = x + cardW - 3 - (int)strlen(st) * adv;
      u8g2.drawStr(stX, textY, st);

      u8g2.setDrawColor(1);
    }
  }

  // ---- แถบล่าง: เรียงตามความเร่งด่วน ----
  u8g2.drawHLine(0, 53, 128);
  u8g2.setFont(u8g2_font_5x8_tf);
  char buf[36];
  uint8_t beyond = heardBeyondBedCount();

  if (alarmBed > 0) {
    snprintf(buf, sizeof(buf), "%sB%d %s", isSnoozed() ? "(ZZ) " : "! ", alarmBed, alertTextEn(alarmCode));
    u8g2.drawBox(0, 54, 128, 10);
    u8g2.setDrawColor(0);
    u8g2.drawStr(2, 62, buf);
    u8g2.setDrawColor(1);
  }
  else if (anyIdConflict()) {
    // สำคัญกว่าทุกอย่างที่เหลือ เพราะทำให้ข้อมูลของเตียงอื่นหายไปทั้งเตียง
    u8g2.drawBox(0, 54, 128, 10);
    u8g2.setDrawColor(0);
    u8g2.drawStr(2, 62, "! 2 NODES SAME BED ID");
    u8g2.setDrawColor(1);
  }
  else if (beyond > 0) {
    snprintf(buf, sizeof(buf), "! HEARD BED %d - ADD BEDS", beyond);
    u8g2.drawFrame(0, 54, 128, 10);
    u8g2.drawStr(2, 62, buf);
  }
  else {
    int nearBed = 0;
    for (int i = 0; i < activeStationCount; i++) {
      if (stations[i].alertCode == ALERT_NEAR_END && !stations[i].nearEndAck) { nearBed = i + 1; break; }
    }
    if (nearBed > 0) {
      const StationData &ns = stations[nearBed - 1];
      int pct = (ns.cfg.planVolumeMl > 0) ? (int)(ns.totalVolumeMl * 100.0f / ns.cfg.planVolumeMl) : 0;
      snprintf(buf, sizeof(buf), "B%d NEW BAG SOON %d%%", nearBed, pct);
      u8g2.drawFrame(0, 54, 128, 10);
      u8g2.drawStr(2, 62, buf);
    } else {
      snprintf(buf, sizeof(buf), "ONLINE %d/%d", onlineCount, activeStationCount);
      u8g2.drawStr(0, 62, buf);
    }
  }
}

void updateHostOLED() {
  if (oledDisplaySleeping || isPowerOffProgressActive) return;
  u8g2.clearBuffer();

  bool nearPending = anyNearEndPending();
  if (!oledScreensaverActive && !globalAlarmTriggered && !nearPending && (millis() - lastUserActivityTime >= 300000)) {
    oledScreensaverActive = true;
  }
  // มีเหตุวิกฤต (ยังไม่พักเสียง) หรือเตือนใกล้หมดที่ยังไม่รับทราบ -> ออกจาก Screensaver เพื่อแสดงเตือน
  if (oledScreensaverActive && ((globalAlarmTriggered && !isSnoozed()) || nearPending)) {
    oledScreensaverActive = false;
    currentOledPage = 0;
  }

  if (oledScreensaverActive) {
    u8g2.setFont(u8g2_font_7x13_tf);
    u8g2.drawStr(20, 10, "SMART IV CLOCK");
    u8g2.drawHLine(10, 13, 108);

    u8g2.setFont(u8g2_font_logisoso32_tf);
    String clockStr = getOledClockStr();
    u8g2.drawStr(4, 56, clockStr.c_str());
  }
  else if (currentOledPage == 0) {
    // หัวจอ: ชื่อหน้า + นาฬิกา (เลขจำนวนเตียงย้ายไปอยู่แถบล่างแล้ว ไม่ต้องบอกสองที่)
    u8g2.setFont(u8g2_font_5x8_tf);
    u8g2.drawStr(0, 7, "IV MONITOR");
    String clk = getOledClockStr();
    u8g2.drawStr(128 - (int)clk.length() * 5, 7, clk.c_str());
    u8g2.drawHLine(0, 9, 128);

    renderBlockStyleGrid();
  }
  else if (currentOledPage >= 1 && currentOledPage <= activeStationCount) {
    int idx = currentOledPage - 1;
    const StationData &s = stations[idx];
    bool isOnline = isStationOnline(idx);
    bool isPaused = isOnline && !s.isRunning;

    // ---- หัวจอ: เลขเตียงตัวใหญ่ อ่านออกทันทีว่ากำลังดูเตียงไหน ----
    char headBuf[16];
    snprintf(headBuf, sizeof(headBuf), "BED %d", currentOledPage);
    u8g2.setFont(u8g2_font_7x13_tf);
    u8g2.drawStr(0, 10, headBuf);
    u8g2.setFont(u8g2_font_5x8_tf);
    u8g2.drawStr(50, 9, shortStatusOf(idx));
    u8g2.drawHLine(0, 12, 128);

    // ---- กระเปาะหยด: ย้ายมาอยู่หน้านี้เท่านั้น มีที่พอให้วาดใหญ่จนเห็นจริง ----
    drawDripChamber(110, 15, 46, idx);

