kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-OLED-V_4_7_4/ESP32-S3-Host-OLED-V_4_7_4.ino
    // ---- อัตราไหล: ตัวเลขใหญ่ที่สุดบนหน้าจอ ----
    if (!isOnline || isPaused) {
      u8g2.setFont(u8g2_font_logisoso16_tf);
      u8g2.drawStr(2, 34, isOnline ? "PAUSED" : "OFFLINE");
    } else {
      char rBuf[12];
      snprintf(rBuf, sizeof(rBuf), "%.0f", s.flowRate_ml_hr);
      u8g2.setFont(u8g2_font_logisoso32_tf);
      u8g2.drawStr(2, 44, rBuf);
      u8g2.setFont(u8g2_font_6x10_tf);
      u8g2.drawStr(62, 26, "mL/h");
      char setBuf[16];
      snprintf(setBuf, sizeof(setBuf), "set %.0f", s.cfg.targetRateHr);
      u8g2.setFont(u8g2_font_5x8_tf);
      u8g2.drawStr(62, 40, setBuf);
    }

    // ---- แถบความคืบหน้าของถุง แทนตัวเลขปริมาตรสองชุดที่อ่านยาก ----
    int pct = (s.cfg.planVolumeMl > 0)
              ? (int)(s.totalVolumeMl * 100.0f / s.cfg.planVolumeMl) : 0;
    if (pct > 100) pct = 100;
    u8g2.drawFrame(0, 47, 104, 7);
    if (pct > 0) u8g2.drawBox(1, 48, (102 * pct) / 100, 5);

    char volBuf[24];
    if (s.cfg.planVolumeMl > 0)
      snprintf(volBuf, sizeof(volBuf), "%.0f/%.0f mL  %d%%", s.totalVolumeMl, s.cfg.planVolumeMl, pct);
    else
      snprintf(volBuf, sizeof(volBuf), "%.0f mL (no plan)", s.totalVolumeMl);
    u8g2.setFont(u8g2_font_5x8_tf);
    u8g2.drawStr(0, 62, volBuf);
  }
  // ---- หน้าตรวจการเชื่อมต่อ (สำหรับช่างเท่านั้น อยู่ท้ายสุดของวง) ----
  else if (currentOledPage == activeStationCount + 1) {
    u8g2.setFont(u8g2_font_5x8_tf);
    u8g2.drawStr(0, 7, "LINK DIAGNOSTIC");
    u8g2.drawHLine(0, 9, 128);

    // ตารางเลขเตียง 1-8: ได้ยินไหม / MAC ท้าย 2 ไบต์ / คุณภาพลิงก์
    u8g2.setFont(u8g2_font_4x6_tf);
    u8g2.drawStr(0, 16, "BED MAC   LNK  BED MAC   LNK");
    for (int i = 0; i < MAX_SUPPORTED_STATIONS; i++) {
      int col = i / 4;
      int row = i % 4;
      int x = col * 65;
      int y = 24 + row * 7;
      const StationData &s = stations[i];
      char line[24];
      if (!heardStationId(i)) {
        snprintf(line, sizeof(line), "%d   --       -", i + 1);
      } else {
        snprintf(line, sizeof(line), "%d   %02X%02X%s %3d", i + 1, s.srcMac[4], s.srcMac[5],
                 s.idConflict ? "*" : " ", s.linkPct);
      }
      if (i >= activeStationCount && heardStationId(i)) {
        u8g2.drawBox(x, y - 5, 62, 7);      // ได้ยินแต่ยังไม่ได้เปิดใช้ = กลับสีให้สะดุดตา
        u8g2.setDrawColor(0);
        u8g2.drawStr(x + 1, y, line);
        u8g2.setDrawColor(1);
      } else {
        u8g2.drawStr(x + 1, y, line);
      }
    }

    u8g2.drawHLine(0, 54, 128);
    u8g2.setFont(u8g2_font_5x8_tf);
    if (anyIdConflict())            u8g2.drawStr(0, 62, "* = 2 NODES SAME ID!");
    else if (heardBeyondBedCount()) u8g2.drawStr(0, 62, "INVERTED = ADD MORE BEDS");
    else                            u8g2.drawStr(0, 62, "ALL BED IDs UNIQUE");
  }

  u8g2.sendBuffer();
}

// ----------------------------------------------------------------------------
// REST APIs & Handlers
// ----------------------------------------------------------------------------
void handleApiData() {
  if (!server.authenticate(web_username, web_password)) return server.requestAuthentication();
  String json;
  json.reserve(3000);
  json = "{";
  json += "\"version\":\"" APP_VERSION "\",";
  json += "\"activeCount\":" + String(activeStationCount) + ",";
  json += "\"currentTime\":\"" + getFormattedDateTime() + "\",";
  json += "\"timeSynced\":" + String(isTimeSynced ? "true" : "false") + ",";
  json += "\"timeApprox\":" + String(isTimeApprox ? "true" : "false") + ",";
  json += "\"apClients\":" + String(WiFi.softAPgetStationNum()) + ",";
  json += "\"apMaxClients\":" + String(AP_MAX_CLIENTS) + ",";
  json += "\"channel\":" + String(currentWifiChannel()) + ",";
  json += "\"hostBatVolts\":" + String(hostBatteryVolts, 2) + ",";
  json += "\"hostBatPct\":" + String(hostBatteryPct) + ",";
  json += "\"snoozed\":" + String(isSnoozed() ? "true" : "false") + ",";
  json += "\"linkWeakPct\":" + String(LINK_WEAK_PCT) + ",";
  json += "\"syncFail\":" + String(syncSendFail) + ",";
  json += "\"heardBeyond\":" + String(heardBeyondBedCount()) + ",";
  json += "\"stations\":[";
  for (int i = 0; i < activeStationCount; i++) {
    const StationData &s = stations[i];
    bool isOnline = isStationOnline(i);
    if (i > 0) json += ",";
    json += "{";
    json += "\"id\":" + String(i + 1) + ",";
    json += "\"online\":" + String(isOnline ? "true" : "false") + ",";
    json += "\"running\":" + String(s.isRunning ? "true" : "false") + ",";
    json += "\"rssi\":" + String(isOnline ? s.rssi : 0) + ",";
    json += "\"link\":" + String(s.linkPct) + ",";
    json += "\"idConflict\":" + String(s.idConflict ? "true" : "false") + ",";
    json += "\"mac\":\"" + macTail(s) + "\",";
    json += "\"rxTotal\":" + String(s.rxTotal) + ",";
    json += "\"battery\":" + String(s.batteryVolts, 2) + ",";
    json += "\"totalDrops\":" + String(s.totalDrops) + ",";
    json += "\"volumeMl\":" + String(s.totalVolumeMl, 2) + ",";
    json += "\"flowRateHr\":" + String(s.flowRate_ml_hr, 2) + ",";
    json += "\"msSinceLastDrop\":" + String(s.msSinceLastDrop) + ",";
    json += "\"targetRate\":" + String(s.cfg.targetRateHr, 1) + ",";
    json += "\"planVolume\":" + String(s.cfg.planVolumeMl, 0) + ",";
    json += "\"dropFactor\":" + String(safeDropFactor(s.cfg.dropFactor)) + ",";
    json += "\"patientName\":\"" + jsonEscape(s.cfg.patientName) + "\",";
    json += "\"alertCode\":" + String(s.alertCode) + ",";
    json += "\"nearEndPct\":" + String(safeNearPct(s.nearEndPct)) + ",";
    json += "\"nearEndAck\":" + String(s.nearEndAck ? "true" : "false") + ",";
    json += "\"caseActive\":" + String(s.trialCase.active ? "true" : "false") + ",";
    json += "\"caseStart\":\"" + String(s.trialCase.startTimeStr) + "\"";
    json += "}";
  }
  json += "]}";
  server.send(200, "application/json", json);
}

int parseStationArg() {
  if (!server.hasArg("station")) return -1;
  int st = server.arg("station").toInt();
  if (st < 1 || st > MAX_SUPPORTED_STATIONS) return -1;
  return st - 1;
}

// POST /api/stations/config  station, rate, volume, df, name (ส่งเฉพาะที่ต้องการเปลี่ยน)
void handleStationConfig() {
  if (!server.authenticate(web_username, web_password)) return server.requestAuthentication();
  int idx = parseStationArg();
  if (idx < 0) { server.send(400, "text/plain", "Invalid station"); return; }

